[
  {
    "id": "1s",
    "url": "../../assets/img/flats/1617587576_17-p-stil-kontemporari-v-interere-kvartiri-18.jpg",
    "price": "450 000 $",
    "square": "3-комн. кв., 76 м",
    "street": "ул. Тимирязева",
    "metro": "Ст.м. Михалова",
    "seller": "Марина",
    "numberOfRooms": 3,
    "floor": 12,
    "maxFloor": 14,
    "typeOfHouse": "каркасно-блочный",
    "balcony": "2 лоджии застекленные",
    "heightOfCeiling": 2.5,
    "yearOfBuilding": 2005,
    "telNumber": "543-12-00",
    "description": "К приобретению доступна квартира 76 м.кв. со свободной планировкой которая располагается в жилом комплексе премиум-класса «Олимпик Парк» (дом 13) на пересечении улиц Тимирязева и Ратомской рядом с водохранилищем Дрозды. Жилой комплекс прилегает к республиканскому заказнику «Лебяжий».\n\n«Олимпик Парк» — тихий уголок в одном из самых живописных и наименее заселенных мест Минска. Каждая деталь малоэтажного квартала премиум-класса создана, чтобы дарить комфорт. Дома ЖК «Олимпик Парк» образуют уютный двор с изобилием зелени и прогулочными местами для спокойного семейного отдыха. Самые активные оценят наличие велосипедных дорожек рядом с собственным домом."
  },
  {
    "id": "2s",
    "url": "../../assets/img/flats/1627040454_32-almode_ru-p-dizainerskie-intereri-kvartir-33.jpg",
    "price": "300 000 $",
    "square": "2-комн. кв., 54 м",
    "street": "пр-т Победителей, д.27.",
    "metro": "Ст.м. Петровщина",
    "seller": "Кристина",
    "numberOfRooms": 2,
    "floor": 2,
    "maxFloor": 9,
    "typeOfHouse": "каркасно-блочный",
    "balcony": "лоджия застекленная",
    "heightOfCeiling": 3.2,
    "yearOfBuilding": 2009,
    "telNumber": "445-58-02",
    "description": "Остекление: заменено во всей квартире на профиль из анодированного алюминия Alutech, фурнитура Savio Италия, пакет 48мм. Остекление лоджии теплое, закаленное, атермальное.\n\nВходная дверь: усиленная 300 кг, 2 замка Cisa Италия, Multilock mt-5 Israel.\n\nКондиционирование: энерго-эффективная мульти-сплит-система на 3 комнаты Daikin Япония; система приточной вентиляции.\n\nПодогрев полов: шесть зон нагрева Devi Дания, управление через Devismart App.\n\nКухня: производитель Stosa Cucine Италия, техника встроенная с тач-панелями Siemens: полноразмерный духовой шкаф плюс пароварка плюс СВЧ три в одном, кофемашина, компактный духовой шкаф плюс пароварка два в одном, два шкафа для нагрева посуды, индукционная варочная стеклокерамическая панель, посудомоечная машина Zeolite; холодильник Liebherr Premium biofresh (три нулевые зоны и одна фреш зона), морозильник Liebherr, вытяжка островного типа Elica Италия. Мойка и смеситель Blanco SteelArt Германия, рабочая поверхность – кварц."
  },
  {
    "id": "3s",
    "url": "../../assets/img/flats/3_669.jpg",
    "price": "250 000 $",
    "square": "2-комн. кв., 50 м",
    "street": "Улица Гинтовта, 31",
    "metro": "Ст.м. Уручье",
    "seller": "Николай",
    "numberOfRooms": 2,
    "floor": 10,
    "maxFloor": 21,
    "typeOfHouse": "каркасно-блочный",
    "balcony": "лоджия застекленная",
    "heightOfCeiling": 2.8,
    "yearOfBuilding": 2014,
    "telNumber": "698-11-12",
    "description": "Стеклопакеты, металлическая входная дверь, счетчики воды, проведено оптоволокно.\n\nРемонт, мебель.\n\nКвартира свободна, готова к заселению.\n\nЧистый и аккуратный подъезд, спокойные соседи. В доме установлены два новых лифта. Дом расположен в одном из красивейших и зеленых районов г. Минска. Отличное транспортное сообщение.\n\nРядом с домом находятся детский сад, школа, музыкальная школа. В шаговой доступности расположен ТЦ «Замок» с множеством магазинов, развлекательной зоной, фудкортом, кинотеатром. На первом этажа самого дома расположен магазин «Соседи». На противоположенной стороне находится красивейший парк «Победы», велодорожка, Комсомольское озеро, зона для отдыха и занятия спортом."
  },
  {
    "id": "4s",
    "url": "../../assets/img/flats/design-gostinoi-foto.jpg",
    "price": "100 000 $",
    "square": "1-комн. кв., 39 м",
    "street": "ул. Петра Глебки 5",
    "metro": "Ст.м. Октябрьская",
    "seller": "Анастасия",
    "numberOfRooms": 1,
    "floor": 8,
    "maxFloor": 10,
    "typeOfHouse": "каркасно-блочный",
    "balcony": "нет",
    "heightOfCeiling": 2.7,
    "yearOfBuilding": 2012,
    "telNumber": "951-75-35",
    "description": "Кухня итальянская - массив с золотой патиной, встроенная техника фирмы SMEG,столешница-камень с литой мойкой. Во всей квартире испанская плитка, полы с подогревом с электронными терморегуляторами. Потолок в гостиной – авторская работа с применением высококачественного полимера. Зона телевизора и входная группа выделена натуральным мрамором. В спальне паркет. В санузле вся сантехника фирмы PORCELANOSA. Во всей квартире межкомнатные двери – известной российской фирмы SOFIA, белый глянец. Огороженная придомовая территория, где Вы всегда беспрепятственно можете оставить свой автомобиль."
  },
  {
    "id": "5s",
    "url": "../../assets/img/flats/EVKSr7SVAAEOxVv.jpg",
    "price": "96 000 $",
    "square": "1-комн. кв., 40 м",
    "street": "ул. Налибокская 1",
    "metro": "Ст.м. Малиновка",
    "seller": "Сергей",
    "numberOfRooms": 1,
    "floor": 11,
    "maxFloor": 18,
    "typeOfHouse": "каркасно-блочный",
    "balcony": "лоджия застекленная",
    "heightOfCeiling": 3,
    "yearOfBuilding": 2011,
    "telNumber": "123-45-69",
    "description": "В шаговой доступности поликлиники, школы, детские сады, магазины, кафе, рынок, ипподром, академия авиации.\n\nНе далеко от дома расположен спортивно-развлекательный комплекс Чижовка-Арена, где можно посетить хоккейные турниры и соревнования по фигурному катанию, есть залы для занятий фитнесом, аэробикой. Для отдыха имеются рестораны, кафе, мини-бары, сауны, боулинг, бильярдный клуб и залы с игровыми автоматами.\n\nРядом с домом находится экотропа «Чижовка». Вдоль тропы обустроены обзорные площадки с информационными стендами и местами для отдыха, пикников и детских игр, а также несколько «карманов» со скамейками.\n\nОживляет и дополняет городской ландшафт Чижовское водохранилище, где можно проводить свое свободное время, гулять с питомцем, заниматься спортом, наслаждаться тишиной и отдыхать от суеты города."
  },
  {
    "id": "6s",
    "url": "../../assets/img/flats/Kvartira-1152x759.jpg",
    "price": "369 000 $",
    "square": "2-комн. кв., 69 м",
    "street": "ул. Немига 3",
    "metro": "Ст.м. Грушевка",
    "seller": "Виктор",
    "numberOfRooms": 2,
    "floor": 4,
    "maxFloor": 22,
    "typeOfHouse": "каркасно-блочный",
    "balcony": "лоджия застекленная",
    "heightOfCeiling": 3.2,
    "yearOfBuilding": 2016,
    "telNumber": "254-36-90",
    "description": "«Соколиный край» – комфортный и уютный комплекс, сочетающий основные тенденции современного строительства: малоэтажные кирпичные дома, просторные подъезды с качественной отделкой, закрытые благоустроенные дворовые территории, современные фасадные решения, комплекс объектов инфраструктуры. Во дворе оборудованы спортивная и детская площадки, проведено озеленение и благоустройство придомовой территории. Хорошее транспортное сообщение, есть возможность выбирать между автомобильным транспортом, есть и автобусные маршруты и маршрутка, либо электричкой до ЖД остановки «Мачулищи»."
  },
  {
    "id": "7s",
    "url": "../../assets/img/flats/Pravila-idealnogo-osveshheniya-v-kvartire-64-1024x820.jpg",
    "price": "521 000 $",
    "square": "4-комн. кв., 101 м",
    "street": "ул. Денисовская 8",
    "metro": "Ст.м. Восток",
    "seller": "Екатерина",
    "numberOfRooms": 4,
    "floor": 16,
    "maxFloor": 25,
    "typeOfHouse": "каркасно-блочный",
    "balcony": "3 лоджии застекленные",
    "heightOfCeiling": 2.9,
    "yearOfBuilding": 2015,
    "telNumber": "583-16-89",
    "description": "Квартира очень теплая, светлая и без вложений, полностью укомплектована и готова к проживанию, территория с детскими площадками, рядом вся инфраструктура, необходимая для комфортного проживания и отдыха: велодорожки, детские сады, школы и гимназии, магазины \"Евроопт\",\"Виталюр\", почта, банки, поликлиника, различные торговые центры, отличное транспортное сообщение, пару остановок до станции метро \"Петровщина\", удобный выезд на МКАД, торг."
  },
  {
    "id": "8s",
    "url": "../../assets/img/flats/image52-min-17.jpg",
    "price": "123 000 $",
    "square": "1-комн. кв., 44 м",
    "street": "ул. Сурганова 50",
    "metro": "Ст.м. Академия наук",
    "seller": "Андрей",
    "numberOfRooms": 1,
    "floor": 5,
    "maxFloor": 8,
    "typeOfHouse": "каркасно-блочный",
    "balcony": "нет",
    "heightOfCeiling": 3,
    "yearOfBuilding": 2010,
    "telNumber": "993-11-82",
    "description": "Живописный район в Московском районе столицы, в котором расположен дом, не оставит никого равнодушным: обилие зеленых зон, \"Парк Яблоневый Сад\", \"Парк имени Павлова\" развитая инфраструктура создают полноценный комфорт для проживающих жильцов, вблизи дома нет сложностей с парковкой авто, благоустроенный двор, видеонаблюдение, ТЦ \"Максимус\" в шаговой доступности."
  }
]
